# FilterStringLessOrEqual Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterStringLessOrEqual Class
Members See Also
---
Tests whether string values from the document would sort before or match a certain string.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class FilterStringLessOrEqual : FilterStringRuleEvaluator
```

Visual Basic
---
```text
Public Class FilterStringLessOrEqual _
	Inherits FilterStringRuleEvaluator
```

Visual C++
---
```text
public ref class FilterStringLessOrEqual : public FilterStringRuleEvaluator
```

# Remarks
All string comparisons in this class are performed in the case-insensitive manner.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FilterStringRuleEvaluator Autodesk.Revit.DB..::..FilterStringLessOrEqual
# See Also
FilterStringLessOrEqual Members
Autodesk.Revit.DB Namespace